<?php
//============================================================
// 通用定义错误码信息:
//============================================================
const _1000001 = "服务器繁忙";
const _1000002 = "重置失败";
const _1000003 = "修改失败";
const _1000004 = "不要频繁操作";
const _1000005 = "类型非法";
const _1000006 = "设置失败";
const _1000007 = "密码由6-10位字母或数字组成";
const _1000008 = "金币不足";
const _1000009 = "操作不合法";

//============================================================
// 用户错误码
//============================================================
const _1000101 = "账号未注册，请先注册";
const _1000102 = "账号已注册";
const _1000103 = "两次输入不一致，请重新输入！";
const _1000104 = "账户注册失败";
const _1000105 = "帐号被冻结";
const _1000106 = "该用户不存在";
const _1000107 = "该用户不是手机号注册，请联系客服！";
const _1000108 = "输入手机号错误";

//============================================================
// 短信错误码
//============================================================
const _1000201 = "短信发送次数超出限制";
const _1000202 = "验证码错误，请重新输入！";
const _1000203 = "短信验证码非法";
const _1000204 = "短信验证码已使用";
const _1000205 = "短信验证码已超时，请重新获取验证码！";

//============================================================
// 用户反馈
//============================================================
const _1000301 = "请输入反馈的内容";

//============================================================
// 保险箱
//============================================================
const _1000401 = "未设置保险箱，请先设置";
const _1000402 = "保险箱禁用中";
const _1000403 = "保险箱密码错误";
const _1000404 = "保险箱不足以支付";
const _1000405 = "账户余额不足以支付";
const _1000406 = "保险箱已设置过密码";
const _1000407 = "保险箱未设置过密码";
const _1000408 = "保险箱密码错误";

//============================================================
// 福利中心
//============================================================
const _1000501 = "该天天福利不存在";
const _1000502 = "该天天福利未开始";
const _1000503 = "该天天福利已结束";
const _1000504 = "该天天福利不匹配";
const _1000505 = "该天天福利补贴不存在";
const _1000506 = "不满足领取福利补贴的条件";
const _1000507 = "福利补贴已领取完";
const _1000508 = "福利补贴领取失败";
const _1000509 = "签到失败";
const _1000510 = "领取累积奖励失败";
const _1000511 = "分享规则未添加";
const _1000512 = "该用户已绑定过邀请人id号";
const _1000513 = "该用户已过新用户时间";
const _1000514 = "绑定邀请人id号失败";
const _1000515 = "该用户未绑定过邀请人id号";
const _1000516 = "新用户邀请奖励已领取";
const _1000517 = "新用户未完成领取条件";
const _1000518 = "用户领取奖励失败";
const _1000519 = "分享未达到领取奖励的条件";
const _1000520 = "未查询到该分享奖励或者是该奖励已被领取";

//============================================================
// 每日在线奖励
//============================================================
const _1000601 = "未配置在线奖励";
const _1000602 = "非法金币操作";
const _1000603 = "领取每日在线奖励失败";

//============================================================
// vip特权奖励
//============================================================
const _1000701 = "未获取到vip特权权限";
const _1000702 = "vip特权规则非法";
const _1000703 = "您今日已领取过特权奖励";
const _1000704 = "领取特权奖励失败";
const _1000705 = "您未充值，请先充值后即可领取";
const _1000706 = "您已领取过首次充值礼包";
const _1000707 = "系统未查询到礼包信息，请联系客服";
const _1000708 = "领取首充礼包失败，请重试";

//============================================================
// 商城
//============================================================
const _1000801 = "商品不存在";
const _1000802 = "钻石不足，请先充值";
const _1000803 = "购买失败，请重试!";
const _1000804 = "商品类型非法";
const _1000805 = "";
const _1000806 = "";

//============================================================
// 每日任务
//============================================================
const _1000901 = "任务不存在";
const _1000902 = "该任务已领取";
const _1000903 = "不满足领取任务奖励";
const _1000904 = "领取任务奖励失败";
const _1000905 = "";
const _1000906 = "";

//============================================================
// 用户广播
//============================================================
const _1001001 = "发送广播失败，请重试!";

//============================================================
// 礼物
//============================================================
const _1001101 = "人气值不够";
const _1001102 = "兑换未设置，请等待";
const _1001103 = "不存在该礼物";
const _1001104 = "赠送礼物失败";
const _1001105 = "赠送对方不存在";
const _1001106 = "赠送频率过快";
const _1001107 = "兑换人气值失败";
const _1001108 = "不可赠送给自己";